{"data":{"id":"Ekko","key":"245","name":"时间刺客","title":"艾克","tags":["Assassin","Fighter"],"image":{"full":"Ekko.png","sprite":"champion0.png","group":"champion","x":144,"y":96,"w":48,"h":48},"skins":[{"id":"245000","num":0,"name":"default","chromas":false},{"id":"245001","num":1,"name":"时之砂 艾克","chromas":true},{"id":"245002","num":2,"name":"任性学霸 艾克","chromas":false},{"id":"245003","num":3,"name":"源计划：自由 艾克","chromas":false}],"info":{"attack":5,"defense":3,"magic":7,"difficulty":8},"spells":[{"id":"EkkoQ","name":"时间卷曲器","description":"艾克扔出一个时光手雷，这个手雷会在命中一个敌方英雄后扩展为一个时间扭曲的力场，对场内的所有敌方单位造成伤害和减速效果。然后它会在短暂的延迟后返回到艾克手上，返回途中会对沿途的敌人造成伤害。","image":{"full":"EkkoQ.png","sprite":"spell2.png","group":"spell","x":432,"y":96,"w":48,"h":48},"tooltip":"艾克扔出一个设备，对沿途的敌人造成60\/75\/90\/105\/120<span class=\"color99FF99\">(+0.3)<\/span>魔法伤害。 它会在命中第一个敌方英雄后扩展为一个减速场，使场内的一切东西减速32\/39\/46\/53\/60%。然后它会在短暂的延迟后返回到艾克手上，返回途中会对所有命中的敌人造成40\/65\/90\/115\/140<span class=\"color99FF99\">(+0.6)<\/span>魔法伤害。","leveltip":{"label":["往程伤害","返程伤害","减速幅度","冷却时间","法力消耗"],"effect":["60\/75\/90\/105\/120","40\/65\/90\/115\/140","32\/39\/46\/53\/60%","9\/8.5\/8\/7.5\/7","50\/60\/70\/80\/90"]},"resource":"50\/60\/70\/80\/90法力"},{"id":"EkkoW","name":"时光交错","description":"艾克分离这条时间线，制造一个不稳定的异常时间点，这个时间点会在数秒后对范围内的敌人造成减速效果。如果艾克进入了这个异常时间点，那么他会获得护盾并引发一次爆炸，让范围内的敌人因悬浮在时间中而陷入晕眩状态。","image":{"full":"EkkoW.png","sprite":"spell2.png","group":"spell","x":0,"y":144,"w":48,"h":48},"tooltip":"<span class=\"colorFF9900\">被动：<\/span>艾克的普攻会对生命值低于30%的敌人造成额外魔法伤害，伤害值相当于目标的3%<span class=\"color99FF99\">(+0.03%)<\/span>已损失生命值。对小兵和野怪的伤害：最小为15，最大为150。<br><br><span class=\"colorFF9900\">主动：<\/span>在3秒延迟后，艾克在目标区域制造一个暂时的时间场，并让进入它的敌人减速%。如果艾克进入这个时间场，那么他会引爆它，获得一层持续2秒的护盾，护盾最多可吸收80\/100\/120\/140\/160<span class=\"color99FF99\">(+1.5)<\/span>伤害。在爆炸范围内的敌人会被晕眩1.75秒。","leveltip":{"label":["护盾生命值","冷却时间","法力消耗"],"effect":["80\/100\/120\/140\/160","22\/20\/18\/16\/14","50\/55\/60\/65\/70"]},"resource":"50\/55\/60\/65\/70法力"},{"id":"EkkoE","name":"相位俯冲","description":"艾克在为Z型驱动充能的同时灵巧地滚动。他的下次攻击将造成魔法伤害并扭曲时间，并让他传送到他的攻击目标旁。","image":{"full":"EkkoE.png","sprite":"spell2.png","group":"spell","x":48,"y":144,"w":48,"h":48},"tooltip":"艾克朝着目标方向位移一段距离。他的下次攻击将造成40\/65\/90\/115\/140<span class=\"color99FF99\">(+0.4)<\/span>魔法伤害，并让他传送到他的攻击目标旁。","leveltip":{"label":["伤害","冷却时间","法力消耗"],"effect":["40\/65\/90\/115\/140","11\/10\/9\/8\/7","40\/50\/60\/70\/80"]},"resource":"40\/50\/60\/70\/80法力"},{"id":"EkkoR","name":"时空断裂","description":"艾克打破他的时间线，变得不可被选取并回溯到一个更加有利的时间点上。他会回到几秒前的位置，并治疗这几秒内所受的伤势。在完成传送后，传送终点区域附近的敌人都会受到巨量伤害。","image":{"full":"EkkoR.png","sprite":"spell2.png","group":"spell","x":96,"y":144,"w":48,"h":48},"tooltip":"艾克回到过去的时间点上，暂时免疫伤害且无法被选取。他传送回4秒前所在的地方，并在到达后对附近的所有敌人造成150\/300\/450<span class=\"color99FF99\">(+1.5)<\/span>魔法伤害。此外，艾克会治疗自身100\/150\/200<span class=\"color99FF99\">(+0.6)<\/span>生命值，且最近4秒里每损失1%生命值就会提升3%治疗效果。","leveltip":{"label":["伤害","固定治疗量","冷却时间"],"effect":["150\/300\/450","100\/150\/200","110\/90\/70"]},"resource":"100法力"}],"passive":{"name":"Z型驱动共振","description":"艾克的Z型驱动会让他的技能和普攻充盈着时光能量。第三次命中将会造成额外伤害，如果目标是一名英雄，那么艾克自己会获得移动加速效果。","image":{"full":"Ekko_P.png","sprite":"passive0.png","group":"passive","x":144,"y":96,"w":48,"h":48}},"lore":"艾克是一名来自祖安不良街区的奇才。他可以操纵时间，从而让任何处境都变得对自己有利。通过使用他自己的发明——Z型驱动——他可以探索其他平行现实的分支并创造最完美的条件。尽管他酷爱这种自由，但只要他的朋友们遇到了威胁，他就会不顾一切地去保护他们。在旁观者眼里，艾克总是能初次尝试就完成不可能之举，事事如此。 艾克是个高智商天才，他甚至在学会爬之前就先学会了制作简单机械。他的父母茵娜和维斯对儿子展现出的天资感到无比欣喜，因此发誓要为他提供一个光明的未来。在他们眼里，祖安充斥着污染和犯罪，配不上他的天生才智。他们每日都在高危职业岗位上加班加点，辛苦工作，只为了给他们的儿子创造一条通往皮尔特沃夫的前途。 但艾克另有看法。<br><br>他目睹着父母提早衰老，用微薄的薪水维持家庭开支，而他们生产的商品却以天价卖给皮城的富人，之间的利润差价全都牢牢握在坊木工会和精明的中间商手里。一些皮佬会逛到舞步走廊寻找廉价的消遣，或者下到缓台广场找一间“百无禁忌”的酒吧纵情狂欢。所以，他父母为他构想的在进步之城的美好生活，让他无法认同。<br><br>再看祖安，他的父母只能看到一层层压得人喘不过气的污染和无法无天的犯罪，但是艾克却能看到它们背后那个充满活力的城市，时刻都洋溢着力量和潜能。祖安是创新的温床，是文化的熔锅，外来的移民到这里都是为了成为未来的先行者。但即使是这些先行者，也不能和土生土长的祖安佬相提并论。祖安佬说的不是那些经过义体增强的恶棍，也不是那些经常登上皮尔特沃夫新闻报道的恃强凌弱的杂碎，而是那些底层地沟拳手、炼金师傅，和专门照看培养塔的植物培育师。无数像他们这样的人，组成了祖安城的心脏和灵魂。他们足智多谋、顽强不屈、勤奋刻苦。他们从灾难过后的瓦砾中建起了繁荣的文明，在其他人必死无疑的绝境中兴旺发达。这种祖安精神感召着艾克，趋策他专门使用别人遗弃的垃圾制造自己的发明，而且一定要拿自己做试验。<br><br>拥有这种精神的不止艾克一个人，他结识了许多好斗、好奇的孤儿和逃家的孩子，还有任何渴望寻求刺激的人，他们对冒险的渴望，就像灰痘病一样具有传染性。每个人都有一样绝活：有的擅长攀爬，有的擅长雕刻，有的擅长绘画，有的擅长密谋。许多祖安佬都不愿意接受正统教育，而是喜欢以师徒传承的方式学习一门技艺，而这些自称为“祖安迷童”的孩子们都拜同一个师父，那就是祖安迷宫一般的街道，他们在师父的陪伴下，用年轻人的方式豪情万丈地挥霍青春。<br><br>为了让自己的小团体有别于其他犯罪帮派和炼金朋克少年，艾克和他的伙伴们特意保持自己健全的身体。对他们来说，截肢并安装强化义体是浪费钱财的鄙陋之举。同理，偷窃那些一无所有或者同样贫穷的人，也是不能接受的。所以那些光鲜亮丽的皮佬和义体强化的恶霸就变成了他们恶作剧的理想目标。在他们的秘密基地里，装点了各种偷来的战利品，还有直接画在墙上的艺术彩绘。祖安迷童们觉得自己所向披靡。<br><br>随着艾克逐渐长大，他的发明也越来越神奇、越来越复杂，因此需要一些珍稀的零件，只能从私人经营的垃圾厂里“解救”出来。好在他对于私闯领地这件事的看法很灵活。没过多久，祖安的猛汉恶徒和残暴的守卫都开始时刻提防着艾克和他古怪的帮派，经常和这些孩子们上演欢乐的追逐戏码。艾克一直都觉得好笑，不知道为什么皮城实验室和炼金男爵工厂全都会分派重兵把守他们的垃圾。他们又不会真正利用这些被抛弃的科技装置。相反，在他的手里，这些垃圾全都能够巧妙地变废为宝。<br><br>一天夜里，艾克前往一座刚刚被炸毁的实验室废墟捡垃圾，他惊讶地发现了一件宝贝：一块蓝绿色的放着魔法亮光的水晶碎片。他快速搜寻附近，找到了其他的碎片。这些碎片似乎在低声哼唱，想要唱出一段破碎的旋律，每当碎片彼此接近，这首歌的声音就会稍稍变大。他耐着性子找齐了每一块水晶碎片，其中一些被埋在废墟深处，他不得不钻进各种臭气熏天的垃圾堆里。每个祖安的孩子都听说过海克斯水晶的故事。这种水晶是神兵和英雄们的力量之源。它们可以自行产生能量，它们有着改变世界的潜力。而现在他手里就握着一块破碎的海克斯水晶。<br><br>他还没来得及庆祝自己的发现，这里就被一群猛汉围住了，他们正在进行地毯式的搜索，显然是在寻找什么。艾克知道，他们要找的就是他手中的这块水晶。最后他勉强躲过了这次搜查。<br><br>经过一丝不苟的研究，艾克发现只要水晶碎片相互靠近，就会散发出微弱的能量激荡的痕迹，水晶的边缘会发出微弱的噼啪声，能量的波纹扭曲着周围的空气。当他把碎片拽开的时候，能感受到一种像是磁场的反向作用力。似乎这块破碎的水晶存在着曾经完整形态的记忆。更有趣的是，艾克产生了一种奇怪的感受，总觉得自己记忆中经历过当下这个瞬间，但记忆和现实又存在些许差别。<br><br>他的双手已经跟不上他头脑中关于这枚水晶的设想。在一次不那么科学的试验中，水晶爆炸成了一团晶体尘埃形成的漩涡，触发了扭曲时间的气旋。艾克睁开眼，看到了许多个现实的分支，也看到了许多个自己在这一刻的镜像，镜像也在万分惊恐地看着自己，在碎裂的时空中不知所措。 这一次他真的做到了。 艾克和自己和自己的平行现实镜像进行了大量配合，最后控制并修复了他在现实时空中撕开的裂口。 最终，艾克通过一种装置驾驭了这枚破碎水晶的时空之力，可以让他操控一段短暂的时间 —— 至少理论上是这样。还没等他进行最新改动后的测试，他的伙伴们就叫嚷着拉他去攀登老饿鬼，以此庆祝他的命名日，于是艾克就挎着他的装置出发了。<br><br>他们翻越各种障碍来到了祖安旧城区的古老钟塔“老饿鬼”，开始向上攀爬，中间不时停下来画上一两副著名皮佬的下流讽刺漫画。就在他们快要登上楼顶的时候，他的一名伙伴误抓了松动的把手，失手摔了下去。艾克本能地发动了水晶装置，动作娴熟犹如练习过成百上千次一般。他周围的世界破碎了，他自己通过时间的粒子洪流回溯到了刚才的一刻。<br><br>他胳膊上的汗毛因为静电而竖起。他一阵头晕眼花。然后他看到自己的伙伴伸手够向那根松动的把手，即将重复他葬送性命的失误。咔擦！把手在男孩的重量下断裂，但艾克伸手在半空中抓住了同伴的领子，然后将他顺势扔向附近的横档。不幸的是，他错误估计了抛物线轨迹，把同伴扔进了钟塔的巨型齿轮。搞砸了。<br><br>经过无数次回溯，又根据风向进行了一些调整，艾克终于救下了好友的性命。在其他人眼里，艾克靠的是神一般的反应，他立刻受到了追捧。艾克向伙伴们如实交代了水晶和时间操控的事，而且要求他们发誓保密。但事与愿违，他的伙伴们恬不知耻地吹嘘艾克的功劳，有恃无恐、并且变本加厉地挑战各种鲁莽的特技动作。每次试炼（及其背后无数次试错）都让他的时间装置（他给取名为Z型驱动）更加稳定。艾克发现自己可以偷窃一切对手，击倒壮硕的炼金朋克恶霸，甚至用正确的台词搭讪，总能初次见面就留下好印象。唯一的使用限制，就是他自己的身体所能承受的疲劳极限。<br><br>艾克扭转时间的传闻和轶事很快传到了上下两座城市里的权贵大人物耳中。备受敬畏的祖安科学家维克多就很想当面验证一下这个不羁的小天才，他用强力的增强体武装了几名手下，试图规劝这个男孩为他效力。而名声在外的皮城创新学者杰斯则一心想要追赶“打破时间的少年”的称号，试图破解他的技术。不过，艾克太看重自己的自由独立，所以并不打算参与任何人的项目。少数追捕者可能有机会瞥见艾克一眼，但他们的追捕计划很快就会泡汤，通常下场都十分尴尬，因为这名地沟孩童天生就擅长搜寻他们的弱点。 艾克最狂野的梦想，就是有朝一日自己的故乡能够崛起，让现在的进步之城相形见绌。皮尔特沃夫的光鲜外表将笼罩在祖安人的精妙创意和无悔勇气之下，二者之间的差距绝非来自世代传承的特权，而是来自单纯的冒险精神。或许他现在还没有具体的计划，但艾克有大把时间，把这个梦想变为现实。 毕竟，既然他能够改变过去，那么改变未来又有何难？","blurb":"艾克是一名来自祖安不良街区的奇才。他可以操纵时间，从而让任何处境都变得对自己有利。通过使用他自己的发明——Z型驱动——他可以探索其他平行现实的分支并创造最完美的条件。尽管他酷爱这种自由，但只要他的朋友们遇到了威胁，他就会不顾一切地去保护他们。在旁观者眼里，艾克总是能初次尝试就完成不可能之举，事事如此。 艾克是个高智商天才，他甚至在学会爬之前就先学会了制作简单机械。他的父母茵娜和维斯对儿子展现出的天资感到无比欣喜，因此发誓要为他提供一个光明的未来。在他们眼里，祖安充斥着污染和犯罪，配不上他的天生才智。他...","allytips":["- 【R时空断裂】是一个有效的逃生手段，但它在用来进攻时也会非常给力。","- 如果你能够在一名敌方英雄身上触发【Z型驱动共振】，那么即使要承担一定风险也非常值得一试。它所提供的移速加成会让你轻松脱身。","- 【E相位俯冲】的位移是个非常好的起手技能，能让你轻松连上艾克的其它技能。用它来让【Q时间卷曲器】完成双次命中，或者达到【W时光交错】的引爆范围。"],"enemytips":["- 艾克在大招没冷却的时候非常弱。要注意他留在身后的痕迹，来判断他的大招是否可用。","- 艾克的晕眩区域需要布置3秒。看好他在施法时创造的幻象，并试着猜一下那个区域放在哪个地方了。","- 时间卷曲器的第二次攻击造成的伤害比第一次更多；尽量避开它。"],"blocks":[{"map":"12","mode":"ARAM","recommended":[{"type":"beginner_starter","recMath":false,"recSteps":false,"minSummonerLevel":-1,"maxSummonerLevel":4,"showIfSummonerSpell":"","hideIfSummonerSpell":"","items":[{"id":"1056","count":1,"hideCount":false}]},{"type":"beginner_starter","recMath":false,"recSteps":false,"minSummonerLevel":5,"maxSummonerLevel":-1,"showIfSummonerSpell":"","hideIfSummonerSpell":"","items":[{"id":"1056","count":1,"hideCount":false},{"id":"2003","count":1,"hideCount":false}]},{"type":"beginner_advanced","recMath":true,"recSteps":false,"minSummonerLevel":-1,"maxSummonerLevel":-1,"showIfSummonerSpell":"","hideIfSummonerSpell":"","items":[{"id":"1028","count":1,"hideCount":false},{"id":"1027","count":1,"hideCount":false},{"id":"3010","count":1,"hideCount":false}]},{"type":"beginner_movementspeed","recMath":true,"recSteps":false,"minSummonerLevel":-1,"maxSummonerLevel":-1,"showIfSummonerSpell":"","hideIfSummonerSpell":"","items":[{"id":"1001","count":1,"hideCount":false},{"id":"3020","count":1,"hideCount":false}]},{"type":"beginner_legendaryitem","recMath":true,"recSteps":false,"minSummonerLevel":-1,"maxSummonerLevel":-1,"showIfSummonerSpell":"","hideIfSummonerSpell":"","items":[{"id":"3010","count":1,"hideCount":false},{"id":"1026","count":1,"hideCount":false},{"id":"3027","count":1,"hideCount":false}]},{"type":"beginner_morelegendaryitems","recMath":false,"recSteps":false,"minSummonerLevel":-1,"maxSummonerLevel":-1,"showIfSummonerSpell":"","hideIfSummonerSpell":"","items":[{"id":"3116","count":1,"hideCount":false},{"id":"3089","count":1,"hideCount":false},{"id":"3135","count":1,"hideCount":false}]}]},{"map":"12","mode":"ARAM","recommended":[{"type":"starting","recMath":false,"recSteps":false,"minSummonerLevel":-1,"maxSummonerLevel":-1,"showIfSummonerSpell":"","hideIfSummonerSpell":"","items":[{"id":"3112","count":1,"hideCount":false},{"id":"1001","count":1,"hideCount":false},{"id":"2003","count":3,"hideCount":false}]},{"type":"essential","recMath":false,"recSteps":false,"minSummonerLevel":-1,"maxSummonerLevel":-1,"showIfSummonerSpell":"","hideIfSummonerSpell":"","items":[{"id":"3020","count":1,"hideCount":false},{"id":"3157","count":1,"hideCount":false},{"id":"3102","count":1,"hideCount":false}]},{"type":"offensive","recMath":false,"recSteps":false,"minSummonerLevel":-1,"maxSummonerLevel":-1,"showIfSummonerSpell":"","hideIfSummonerSpell":"","items":[{"id":"3100","count":1,"hideCount":false},{"id":"3089","count":1,"hideCount":false},{"id":"3165","count":1,"hideCount":false}]},{"type":"defensive","recMath":false,"recSteps":false,"minSummonerLevel":-1,"maxSummonerLevel":-1,"showIfSummonerSpell":"","hideIfSummonerSpell":"","items":[{"id":"3152","count":1,"hideCount":false},{"id":"3025","count":1,"hideCount":false},{"id":"3065","count":1,"hideCount":false}]},{"type":"consumables","recMath":false,"recSteps":false,"minSummonerLevel":-1,"maxSummonerLevel":-1,"showIfSummonerSpell":"","hideIfSummonerSpell":"","items":[{"id":"2003","count":1,"hideCount":false},{"id":"2139","count":1,"hideCount":false},{"id":"2033","count":1,"hideCount":false}]}]},{"map":"1","mode":"CLASSIC","recommended":[{"type":"starting","recMath":false,"recSteps":false,"minSummonerLevel":-1,"maxSummonerLevel":-1,"showIfSummonerSpell":"","hideIfSummonerSpell":"SummonerSmite","items":[{"id":"1056","count":1,"hideCount":false},{"id":"2003","count":2,"hideCount":false},{"id":"3340","count":1,"hideCount":false}]},{"type":"startingjungle","recMath":false,"recSteps":false,"minSummonerLevel":-1,"maxSummonerLevel":-1,"showIfSummonerSpell":"SummonerSmite","hideIfSummonerSpell":"","items":[{"id":"1039","count":1,"hideCount":false},{"id":"2031","count":1,"hideCount":false},{"id":"3340","count":1,"hideCount":false}]},{"type":"early","recMath":false,"recSteps":false,"minSummonerLevel":-1,"maxSummonerLevel":-1,"showIfSummonerSpell":"","hideIfSummonerSpell":"SummonerSmite","items":[{"id":"3108","count":1,"hideCount":false},{"id":"3802","count":1,"hideCount":false},{"id":"1001","count":1,"hideCount":false}]},{"type":"earlyjungle","recMath":false,"recSteps":false,"minSummonerLevel":-1,"maxSummonerLevel":-1,"showIfSummonerSpell":"SummonerSmite","hideIfSummonerSpell":"","items":[{"id":"3706","count":1,"hideCount":false},{"id":"1001","count":1,"hideCount":false},{"id":"3113","count":1,"hideCount":false}]},{"type":"essential","recMath":false,"recSteps":false,"minSummonerLevel":-1,"maxSummonerLevel":-1,"showIfSummonerSpell":"","hideIfSummonerSpell":"SummonerSmite","items":[{"id":"3165","count":1,"hideCount":false},{"id":"3020","count":1,"hideCount":false},{"id":"3102","count":1,"hideCount":false}]},{"type":"essentialjungle","recMath":false,"recSteps":false,"minSummonerLevel":-1,"maxSummonerLevel":-1,"showIfSummonerSpell":"SummonerSmite","hideIfSummonerSpell":"","items":[{"id":"1402","count":1,"hideCount":false},{"id":"3020","count":1,"hideCount":false},{"id":"3157","count":1,"hideCount":false}]},{"type":"offensive","recMath":false,"recSteps":false,"minSummonerLevel":-1,"maxSummonerLevel":-1,"showIfSummonerSpell":"","hideIfSummonerSpell":"SummonerSmite","items":[{"id":"3100","count":1,"hideCount":false},{"id":"3135","count":1,"hideCount":false},{"id":"3089","count":1,"hideCount":false}]},{"type":"offensive","recMath":false,"recSteps":false,"minSummonerLevel":-1,"maxSummonerLevel":-1,"showIfSummonerSpell":"SummonerSmite","hideIfSummonerSpell":"","items":[{"id":"3165","count":1,"hideCount":false},{"id":"3100","count":1,"hideCount":false},{"id":"3135","count":1,"hideCount":false}]},{"type":"defensive","recMath":false,"recSteps":false,"minSummonerLevel":-1,"maxSummonerLevel":-1,"showIfSummonerSpell":"","hideIfSummonerSpell":"SummonerSmite","items":[{"id":"3157","count":1,"hideCount":false},{"id":"3152","count":1,"hideCount":false},{"id":"3026","count":1,"hideCount":false}]},{"type":"defensive","recMath":false,"recSteps":false,"minSummonerLevel":-1,"maxSummonerLevel":-1,"showIfSummonerSpell":"SummonerSmite","hideIfSummonerSpell":"","items":[{"id":"3102","count":1,"hideCount":false},{"id":"3152","count":1,"hideCount":false},{"id":"3026","count":1,"hideCount":false}]},{"type":"consumables","recMath":false,"recSteps":false,"minSummonerLevel":-1,"maxSummonerLevel":-1,"showIfSummonerSpell":"","hideIfSummonerSpell":"SummonerSmite","items":[{"id":"2003","count":1,"hideCount":true},{"id":"2055","count":1,"hideCount":true},{"id":"2139","count":1,"hideCount":true}]},{"type":"consumables","recMath":false,"recSteps":false,"minSummonerLevel":-1,"maxSummonerLevel":-1,"showIfSummonerSpell":"SummonerSmite","hideIfSummonerSpell":"","items":[{"id":"2032","count":1,"hideCount":true},{"id":"2055","count":1,"hideCount":true},{"id":"2139","count":1,"hideCount":true}]}]}]},"version":"7.12.1","updated":"2017-06-19"}